<!DOCTYPE html>
<html>
<head>
	<title>Тест PHP</title>
	<link rel="stylesheet" type="text/css" href="css/style.css">
</head>
<body>
	<div class="container">
		<header>
		<img src="logo.png">
			<ul>
		 	<li><a href="http://www.softgroup.ua">Soft Group</a></li>	
		 	<li><a href="avtor.php">Автор</a></li>	
		 	<li><a href="index.php">Головна</a></li>
		 	</ul>
				<div class="title">
					<h1>SoftGroup</h1>
					<h2>Тестове Завдання</h2>
				</div>
		</header>
		<div class="margin">
			<div class="sidebar">

				<ul class="left">
		 	<li class="active"><a href="z1.php">Завдання 1</a></li>	
		 	<li class="active"><a href="z2.php">Завдання 2</a></li>	
		 	<li class="active"><a href="z3.php">Завдання 3</a></li>
		 	<li class="active"><a href="z4.php">Завдання 4</a></li>	
		 	<li class="active"><a href="z5.php">Завдання 5</a></li>	
		 	<li class="active"><a href="z6.php">Завдання 6</a></li>
		 	</ul>
			</div>
			<div class="content">
				<pre>
		    Про Автора
          Присакар Іван Володимирович

Дата народження: 8 серпня 1996 року, вік: 20 років.
Сімейний стан: неодружений.
Контактна інформація:
місце проживання: Новоселицький р-н., село Костичани, вул. Федьковича 29;
в період навчання в університеті: м. Чернівці;
телефон: (095) 538-30-65;
e-mail: piv308@gmail.com.


Мета:
отримати практичні навички програмування, орієнтуючись на реальні вимоги замовників;
розвиватись в сфері комп’ютерних технологій;
підвищити рівень володіння англійською мовою;


Освіта:
2002 – 2008 рр. – Костичанівська ЗОШ 1-3 ст.;
2013 – даний момент – Чернівецький Національний Університет ім. Ю. Федьковича;
спеціальність: комп’ютерна інженерія (4-ій курс);

Знання ПК:
базове знання мов програмування: PHP, Javascript, Delphi, C++, Java а також 
мови розмітки гіпертекстових документів: HTML і мови каскадних таблиці стилів (CSS);
знання принципів об’єктно-орієнтовного програмування;
базове знання архітектури комп'ютера;

Практичний досвід:
створення простих прикладних програм для власного використання 
(мовами програмування C++, Delphi, Java).

Досвід роботи:
на жаль, відсутній.

Іноземні мови:
Румунська мова: на рівні носія;
Англійська: початковий рівень;





</pre>
			</div>

		</div>
		<div class="clear"></div>
		<footer>
			<div>Присакар Іван  ©</div>
			<div>2017</div>
		</footer>
	</div>
</body>
</html>